# MPG Cars

### Introduction:

The following exercise utilizes data from [UC Irvine Machine Learning Repository](https://archive.ics.uci.edu/ml/datasets/Auto+MPG)

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Import the first dataset [cars1](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars1.csv) and [cars2](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars2.csv).

   ### Step 3. Assign each to a variable called cars1 and cars2

In [2]:
link1 = 'https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars1.csv'
link2 = 'https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars2.csv'

cars1 = pd.read_csv(link1)
cars2 = pd.read_csv(link2)

### Step 4. Ops it seems our first dataset has some unnamed blank columns, fix cars1

In [7]:
cars1 = cars1.loc[:, :'car']
cars1.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302,140,3449,10.5,70,1,ford torino

### Step 5. What is the number of observations in each dataset?

In [10]:
print(cars1.shape)
print(cars2.shape)

(198, 9)
(200, 9)

### Step 6. Join cars1 and cars2 into a single DataFrame called cars

In [13]:
cars = cars1.append(cars2)
print(cars.shape)

(398, 9)

### Step 7. Ops there is a column missing, called owners. Create a random number Series from 15,000 to 73,000.

In [15]:
cars['owners'] = np.random.randint(15000, high=73001, size=398, dtype='l')

cars['owners']

0      24161
1      46968
2      58853
3      31970
4      53282
5      25549
6      47308
7      70362
8      48220
9      55010
10     63392
11     58224
12     26349
13     48463
14     68433
15     64522
16     43457
17     61080
18     55843
19     43951
20     65737
21     61783
22     58402
23     55553
24     27415
25     52424
26     64797
27     47300
28     46894
29     26584
       ...
170    34812
171    47660
172    48774
173    23595
174    67889
175    70204
176    67255
177    33123
178    16838
179    53567
180    19970
181    44344
182    38646
183    48805
184    59002
185    18146
186    65967
187    59681
188    56982
189    40797
190    31497
191    19328
192    21402
193    50408
194    44878
195    18594
196    19041
197    32124
198    48559
199    44647
Name: owners, Length: 398, dtype: int64

In [17]:
np.random.randint?

### Step 8. Add the column owners to cars

In [16]:
cars.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car,owners
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu,24161
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320,46968
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite,58853
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst,31970
4,17.0,8,302,140,3449,10.5,70,1,ford torino,53282